//задача 1.2
#include <stdio.h> // бібліотека стандартного вводу виводу С
#include <math.h> // бібліотека матем. ф-ій з С

int main()
{
    float x=0.0001f; // визначаємо дійсну (одинарної точності) змінну х
    double x1=0.0001; // визначаємо дійсну (подвійної точності) змінну х1
    double x2=1e-04;
    printf("x=%g x1=%g x2=%g\n",x,x1,x2);

    double x3=24.33E5; // визначаємо дійсну (подвійної точності) змінну х3
    printf("x3=%.21f\n",x3);

    long double x_pi=3.14159265358979323846264338327950288419716939937510L;
    printf("x_pi=%.50Lf\n",x_pi);
    long double x_pi2=M_PI; // використовуємо константи з math.h
    printf("x_pi=%.50Lf\n",x_pi2);
    double e1=exp(1.0); //обчислення експоненти М_Е
    printf("e1=%2lf\n",e1);

    double s1=sqrt(5); //обчислення квадратного кореня
    printf("sqrt(5)=%.2lf\n",s1);

    double s2=log(100);
    printf("log(100)=%.2lf\n",s2);
}